// 11.24
mod p2235;  // 两数相加
mod p2469;  // 温度转换
mod p2413;  // 最小偶倍数
mod p2236;  // 根节点是否等于子节点之和
// 11.25
mod p1486; // 数组异或操作
mod p1512; // 好数对的题目
mod p258;  // 各位相加
mod p231;  // 2的幂
// 11.26
mod p326;  // 3的幂
mod p263;  // 丑数
mod p1470; // 重新排列数组
mod p709;  // 转换成小写字母
mod p3206; // 交替组1
// 11.27
mod p3208; // 交替组2
mod p1534; // 统计好三元组
mod p1281; // 整数的各位积和之差
mod p867;  // 转置矩阵
mod p1422; // 分割字符串的最大的分
// 11.28
mod p3250; // Todo
mod p2586; // 统计范围内的元音字符串数
mod p852;  // 山脉数组的峰顶索引
mod p1768; // 交替合并字符串
mod p389;  // 找不同