// 11.24
mod p2235;  // 两数相加
mod p2469;  // 温度转换
mod p2413;  // 最小偶倍数
mod p2236;  // 根节点是否等于子节点之和
// 11.25
mod p1486; // 数组异或操作
mod p1512; // 好数对的题目
mod p258;  // 各位相加
mod p231;  // 2的幂
// 11.26
mod p326;  // 3的幂
mod p263;  // 丑数
mod p1470; // 重新排列数组
mod p709;  // 转换成小写字母
mod p3206; // 交替组1
// 11.27
mod p3208; // 交替组2
mod p1534; // 统计好三元组
mod p1281; // 整数的各位积和之差
mod p867;  // 转置矩阵
mod p1422; // 分割字符串的最大的分
// 11.28
mod p3250; // Todo
mod p2586; // 统计范围内的元音字符串数
mod p852;  // 山脉数组的峰顶索引
mod p1768; // 交替合并字符串
mod p389;  // 找不同
mod p28;   // 找出字符串中第一个匹配项的下标
mod p242;  // 有效的字母异位词
// 11.29
// Could be better
mod p283;  // 移动零
mod p66;   // 加一
mod p13;   // 罗马数字转整数
mod p896;  // 单调数列

// 12.1
mod p58;   // 最后一个单词的长度
mod p1822; // 数组元素积的符号
mod p1523; // 奇数的个数
mod p1491; // 去掉高低后的平均工资
// 12.2
mod p860;  // 柠檬水找零
mod p976;  // 三角形最长周长
// 12.3
mod p3274; // 检查棋盘方格颜色是否相同
mod p1502; // 判断能否形成等差数列
mod p1672; // 最富有客户的资产总量
mod p1572; // 矩阵对角线元素和
// 12.4
mod p682;  // 棒球比赛
mod p657;  // 机器人能否返回原点
mod p1275; // 找出井字棋的获胜者
mod p1232; // 缀点成线
// 12.5
mod p20;   // 有效的括号
mod p678;  // 有效的括号字符串

// 12.8 —— HashSet
mod p169;  // 多数元素
mod p217;  // 存在多数元素
mod p268;  // 丢失的数字
mod p349;  // 两个数组的交集